Tekla Open API Reference for Tekla Structures 2025
Plugin Constructor
 Creates a new plug-in instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Plugin(
	ViewBase View,
	string Name
)
Public Sub New (
	View As ViewBase,
	Name As String
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
Name
Type: System.String
The plug-in name to be used.
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace